; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_7)
(:domain joint_bar)
(:objects
    link1 link2 link3 - link
    angle0 angle10 angle20 angle30 angle40 angle50 angle60 angle70 angle80 angle90 angle100 angle110 angle120 angle130 angle140 angle150 angle160 angle170 angle180 angle190 angle200 angle210 angle220 angle230 angle240 angle250 angle260 angle270 angle280 angle290 angle300 angle310 angle320 angle330 angle340 angle350 - angle)
(:init
    (AngleOrd angle0 angle10)
    (AngleOrd angle10 angle20)
    (AngleOrd angle20 angle30)
    (AngleOrd angle30 angle40)
    (AngleOrd angle40 angle50)
    (AngleOrd angle50 angle60)
    (AngleOrd angle60 angle70)
    (AngleOrd angle70 angle80)
    (AngleOrd angle80 angle90)
    (AngleOrd angle90 angle100)
    (AngleOrd angle100 angle110)
    (AngleOrd angle110 angle120)
    (AngleOrd angle120 angle130)
    (AngleOrd angle130 angle140)
    (AngleOrd angle140 angle150)
    (AngleOrd angle150 angle160)
    (AngleOrd angle160 angle170)
    (AngleOrd angle170 angle180)
    (AngleOrd angle180 angle190)
    (AngleOrd angle190 angle200)
    (AngleOrd angle200 angle210)
    (AngleOrd angle210 angle220)
    (AngleOrd angle220 angle230)
    (AngleOrd angle230 angle240)
    (AngleOrd angle240 angle250)
    (AngleOrd angle250 angle260)
    (AngleOrd angle260 angle270)
    (AngleOrd angle270 angle280)
    (AngleOrd angle280 angle290)
    (AngleOrd angle290 angle300)
    (AngleOrd angle300 angle310)
    (AngleOrd angle310 angle320)
    (AngleOrd angle320 angle330)
    (AngleOrd angle330 angle340)
    (AngleOrd angle340 angle350)
    (AngleOrd angle350 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)

    (HasAngle angle190 link1)
    (HasAngle angle300 link2)
    (HasAngle angle280 link3)
)
(:goal
(and
    (HasAngle angle210 link1)
    (HasAngle angle90 link2)
    (HasAngle angle120 link3)
    )
)
)

; plan
1. (increase_angle link1 angle190 angle200)
   deleted: (hasangle angle190 link1) (hasangle angle300 link2) (hasangle angle280 link3)
   added: (hasangle angle200 link1) (hasangle angle310 link2) (hasangle angle290 link3)
   goals met: 0 of 3
2. (increase_angle link1 angle200 angle210)
   deleted: (hasangle angle200 link1) (hasangle angle310 link2) (hasangle angle290 link3)
   added: (hasangle angle210 link1) (hasangle angle320 link2) (hasangle angle300 link3)
   goals met: 1 of 3
3. (increase_angle link2 angle320 angle330)
   deleted: (hasangle angle320 link2) (hasangle angle300 link3)
   added: (hasangle angle330 link2) (hasangle angle310 link3)
   goals met: 1 of 3
4. (increase_angle link2 angle330 angle340)
   deleted: (hasangle angle330 link2) (hasangle angle310 link3)
   added: (hasangle angle340 link2) (hasangle angle320 link3)
   goals met: 1 of 3
5. (increase_angle link2 angle340 angle350)
   deleted: (hasangle angle340 link2) (hasangle angle320 link3)
   added: (hasangle angle350 link2) (hasangle angle330 link3)
   goals met: 1 of 3
6. (increase_angle link2 angle350 angle0)
   deleted: (hasangle angle350 link2) (hasangle angle330 link3)
   added: (hasangle angle0 link2) (hasangle angle340 link3)
   goals met: 1 of 3
7. (increase_angle link2 angle0 angle10)
   deleted: (hasangle angle0 link2) (hasangle angle340 link3)
   added: (hasangle angle10 link2) (hasangle angle350 link3)
   goals met: 1 of 3
8. (increase_angle link2 angle10 angle20)
   deleted: (hasangle angle10 link2) (hasangle angle350 link3)
   added: (hasangle angle20 link2) (hasangle angle0 link3)
   goals met: 1 of 3
9. (increase_angle link2 angle20 angle30)
   deleted: (hasangle angle20 link2) (hasangle angle0 link3)
   added: (hasangle angle30 link2) (hasangle angle10 link3)
   goals met: 1 of 3
10. (increase_angle link2 angle30 angle40)
   deleted: (hasangle angle30 link2) (hasangle angle10 link3)
   added: (hasangle angle40 link2) (hasangle angle20 link3)
   goals met: 1 of 3
11. (increase_angle link2 angle40 angle50)
   deleted: (hasangle angle40 link2) (hasangle angle20 link3)
   added: (hasangle angle50 link2) (hasangle angle30 link3)
   goals met: 1 of 3
12. (increase_angle link2 angle50 angle60)
   deleted: (hasangle angle50 link2) (hasangle angle30 link3)
   added: (hasangle angle60 link2) (hasangle angle40 link3)
   goals met: 1 of 3
13. (increase_angle link2 angle60 angle70)
   deleted: (hasangle angle60 link2) (hasangle angle40 link3)
   added: (hasangle angle70 link2) (hasangle angle50 link3)
   goals met: 1 of 3
14. (increase_angle link2 angle70 angle80)
   deleted: (hasangle angle70 link2) (hasangle angle50 link3)
   added: (hasangle angle80 link2) (hasangle angle60 link3)
   goals met: 1 of 3
15. (increase_angle link2 angle80 angle90)
   deleted: (hasangle angle80 link2) (hasangle angle60 link3)
   added: (hasangle angle90 link2) (hasangle angle70 link3)
   goals met: 2 of 3
16. (increase_angle link3 angle70 angle80)
   deleted: (hasangle angle70 link3)
   added: (hasangle angle80 link3)
   goals met: 2 of 3
17. (increase_angle link3 angle80 angle90)
   deleted: (hasangle angle80 link3)
   added: (hasangle angle90 link3)
   goals met: 2 of 3
18. (increase_angle link3 angle90 angle100)
   deleted: (hasangle angle90 link3)
   added: (hasangle angle100 link3)
   goals met: 2 of 3
19. (increase_angle link3 angle100 angle110)
   deleted: (hasangle angle100 link3)
   added: (hasangle angle110 link3)
   goals met: 2 of 3
20. (increase_angle link3 angle110 angle120)
   deleted: (hasangle angle110 link3)
   added: (hasangle angle120 link3)
   goals met: 3 of 3
